docs: updated architecture diagram
